app/controllers/admin_controller.rb

  def index
    @users = User.find(:all, :order => "last_login_at DESC")
    @size = @users.length
---
SELECT * FROM "users" WHERE ("users"."id" = 12) LIMIT 1
SELECT * FROM "users"

  def edit
    @user = User.find(params[:id])
    if params[:user]
      @user.admin = params[:user][:admin]
      if @user.save
---
SELECT * FROM "users" WHERE ("users"."id" = 12) LIMIT 1
UPDATE "users" SET "updated_at" = '2009-02-23 06:51:52', "admin" = 't' WHERE "id" = 1

  def reset_password
    @user = User.find(params[:id])
    @user.password = Digest::SHA1.hexdigest("yawnlog")
    if @user.save
---
SELECT * FROM "users" WHERE ("users"."id" = 12) LIMIT 1
UPDATE "users" SET "password" = 'e5286b7e3226f0cbca2e72bdb9e2ae6daf88f3c6', "updated_at" = '2009-02-23 06:57:57' WHERE "id" = 24

  def sleep
    @sleeps = Sleep.find(:all, :order => "start DESC")
    @sleep_size = @sleeps.length
---
SELECT * FROM "sleeps" ORDER BY start DESC