app/controllers/sleeps_controller.rb

SELECT * FROM "sleeps" WHERE (user_id=1 AND start<'2009-02-16 00:00:00' AND stop>'2009-02-15 00:00:00')
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
---
  def index
    @sleeps = Sleep.find(:all, :conditions => ["user_id=?", session[:user_id]], :order => "start DESC")
    @user = User.find(session[:user_id])

SELECT * FROM "sleeps" WHERE ("sleeps"."id" = 1)
---
  def show
    @sleep = Sleep.find(params[:id])

SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
---
  def new
    @sleep = Sleep.new
    @user = User.find(session[:user_id])

SELECT * FROM "sleeps" WHERE ("sleeps"."id" = 24)
---
  def edit
    @sleep = Sleep.find(params[:id])

INSERT INTO "sleeps" ("updated_at", "zip", "stop", "start", "note", "user_id", "quality", "created_at") VALUES('2009-02-22 15:23:04', '02155', '2009-02-22 09:07:00', '2009-02-22 08:22:00', '@berkmancenter', 2, 2, '2009-02-22 15:23:04')
---
  def create
    @sleep = Sleep.new(params[:sleep])
    @sleep.user_id = session[:user_id]

    respond_to do |format|
      if @sleep.save

SELECT * FROM "sleeps" WHERE ("sleeps"."id" = 24)
UPDATE "sleeps" SET "stop" = '2009-02-22 08:00:00', "note" = 'After a 4-hour conversation w/ Sam after practice. While I woke up feeling great, after 2 or 3 hours I felt the lack of sleep headache. :-(', "updated_at" = '2009-02-23 04:41:01' WHERE "id" = 40
---
  def update
    @sleep = Sleep.find(params[:id])

    if @sleep.user_id != session[:user_id]
      flash[:notice] = 'Sleep record belongs to another user.'
      redirect_to :controller => 'home'
      return
    end

    respond_to do |format|
      if @sleep.update_attributes(params[:sleep])

SELECT * FROM "sleeps" WHERE ("sleeps"."id" = 79)
DELETE FROM "sleeps" WHERE "id" = 79
---
  def destroy
    @sleep = Sleep.find(params[:id])

    if @sleep.user_id != session[:user_id]
      flash[:notice] = 'Sleep record belongs to another user.'
      redirect_to :controller => 'home'
      return
    end

    @sleep.destroy