app/controllers/users_controller.rb

	def public_profiles
    @users = User.paginate(:page => params[:page], :per_page => 100)
---
SELECT * FROM "users"