app/controllers/users_controller.rb

INSERT INTO "users" ("updated_at", "public_profile", "zip", "target_hours", "twitter", "username", "admin", "password", "realname", "email", "created_at") VALUES('2009-02-23 07:47:43', 't', '96822', 8.0, 'ceanders', 'ceanders', NULL, '6ac54fa5b012bc67d58ece27cb031628a6579c85', 'Carrie', 'ceanders08@gmail.com', '2009-02-23 07:47:43')
---
	def signup_backend
	  sha_passwd = Digest::SHA1.hexdigest(params[:user][:password])
		@user = User.new(:username => params[:user][:username],
		                :email => params[:user][:email],
		                :password => sha_passwd,
		                :realname => params[:user][:realname],
		                :zip => params[:user][:zip],
		                :twitter => params[:user][:twitter].sub(/\@*/,''),
                    :zip => params[:user][:zip],
		                :target_hours => params[:user][:target_hours],
		                :public_profile => params[:user][:public_profile])
	  if params[:user][:password] != params[:user][:password_confirm]
	    flash[:notice] = "Passwords don't match."
			redirect_to :action => :signup
      return
		end

		if @user.save

SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
---
	def public_profiles
	  @users = User.find(:all, :conditions => ["public_profile=?", true])

SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
---
  def user
    @user = User.find(params[:id])

SELECT * FROM "users" WHERE (username='mac' and password='347ead6348e936507920c15d2ae8266ac6ce9b49') LIMIT 1
---
	def login_backend
		username = params[:user][:username]
		password = Digest::SHA1.hexdigest(params[:user][:password])
		user = User.find :first, :conditions => ["username=? and password=?", username, password]

SELECT * FROM "users" WHERE ("users"."id" = 2) LIMIT 1
UPDATE "users" SET "password" = '4a154efe2da4d911d11baf53099574be0193d7ec', "updated_at" = '2009-02-22 15:33:27', "target_hours" = NULL WHERE "id" = 1
---
  def edit
    @user = User.find(session[:user_id])
    if params[:user]
      @user.email = params[:user][:email];
      @user.realname = params[:user][:realname]
      @user.public_profile = params[:user][:public_profile]
      @user.target_hours = params[:user][:target_hours]
      @user.twitter = params[:user][:twitter].sub(/\@*/,'')
      @user.zip = params[:user][:zip]
      if params[:user][:password] != ""

        if params[:user][:password] != params[:user][:password_confirm]
    	    flash[:error] = "Passwords don't match"
    			redirect_to :action => :edit
          return
    		end
    	  @user.password = Digest::SHA1.hexdigest(params[:user][:password])
    	end
      if @user.save